In [1]:
import pymysql
import sqlalchemy
import pandas as pd

In [2]:
%load_ext sql

### 方式一：隐式连接
连接后可以用魔术语句标记后直接运行sql

In [3]:
%sql mysql+pymysql://root:231500@127.0.0.1:3306/atguigudb

In [4]:
%%sql
SELECT last_name,job_id,salary
FROM employees
WHERE salary = (
                SELECT MIN(salary)
                FROM employees
                );

 * mysql+pymysql://root:***@127.0.0.1:3306/atguigudb
1 rows affected.

[('Olson', 'ST_CLERK', 2100.0)]

### 方式二：显示连接
建立连接后，`pandas`可以通过`connection`获取`sql`执行的结果

In [8]:
conn = pymysql.connect(
                        host = 'localhost',
                        user = 'root',
                        password='231500',
                        db = 'atguigudb',
                        port =3306,
                        charset = 'utf8')

如果想用多行`sql`语句，用三双引号即可。<br>
三双引号：允许一个字符串跨行书写

In [20]:
sql_l = """
SELECT last_name,job_id,salary 
FROM employees 
WHERE salary = (SELECT MIN(salary) 
                FROM employees );
"""

In [22]:
data = pd.read_sql(sql_l, conn)
data

  last_name    job_id  salary
0     Olson  ST_CLERK  2100.0

In [23]:
#关闭连接
conn.close